function endingCredit() {
    background(0);
    textAlign(CENTER, CENTER);
    textSize(50);
    text("ENDING CREDIT", width / 2, 0.08 * height);
    textSize(22);
    fill(255, 190, 190);
    text("쑤슌레이나인 소감: 이번 프로젝트를 통해 p5.js를 더 깊이 이해하게 되었고 다양한 활용 방법을 배울 수 있었습니다.\n 대부분 AI의 도움을 받았지만 팀원들의 도움 덕분에 부족한 부분을 채울 수 있었고 협업의 중요성을 느꼈습니다.", width / 2, 0.2 * height);
    fill(100, 170, 250);
    text("이예찬 소감: 생각보다 단순한 구조물을 그리는데도 많은 수고로움이 있었다. 역시 세상에 쉬운일은 하나도 없었다.\n 그리고 AI를 이용하고 싶어도 AI의 작품이 마음에 안드는 경우가 많았기에 우유부단하게 있다가는 더 큰 귀찮음이 다가온다는 것도 알았다.\n 일부만 보고 노력을 측정하려하지 말자 산에서 담배를 밟아 끄는것과 같이 미련한 일이 아닐수없다.", width / 2, 0.32 * height);
    fill(150, 210, 130);
    text("이준서 소감: 협업 코드를 병합하는 역할을 하며 처음부터 전체 구조를 짠 후 그 구조에 맞게 코드를 적는 과정이 필요하다는 것을 알게 되었다.\n 각자 작성한 코드를 내가 생각한 구조대로 고치려 하니 오류도 많이 나고 결과적으로 좋지 못한 구조가 된 것 같아 아쉽지만 결과물이 나오는 것을 보면 또 뿌듯하다.", width / 2, 0.44 * height);
    fill(255);
    text("AI를 이용해 제작한 콘텐츠: scene1과 scene2 대부분, scene3의 불 파티클, 산의 비율 조정,\n scene4의 불과 재, 집 클릭 관련 인터렉션, 하늘 그라데이션, scene5의 연기, scene6의 쓰레기통, finalscene의 하늘 그라데이션", width / 2, 0.53 * height);
    text("코드에서의 AI의 사용 비율: 40%", width / 2, 0.6 * height);
}
